# Chapitre 4

In [369]:
import pandas as pd
from pandas import DataFrame, Series
import numpy as np

## Series

In [370]:
a = Series(np.arange(10))

In [371]:
a.name='valeur'

In [372]:
a.index.name='index'

In [373]:
a.values

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [374]:
a.index

RangeIndex(start=0, stop=10, step=1, name='index')

In [375]:
l = ['aa','bb','cc','dd','ee']*2

In [377]:
ind = np.arange(10,20,1)

In [378]:
ind

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [379]:
s = Series(dict(zip(ind,l)))

In [380]:
s1 = Series(data=l,index=ind,name="test")
s1

10    aa
11    bb
12    cc
13    dd
14    ee
15    aa
16    bb
17    cc
18    dd
19    ee
Name: test, dtype: object

In [381]:
s1 = Series(s,index=[10,11,20])
s1

10     aa
11     bb
20    NaN
dtype: object

In [382]:
l1 = ['aa','bb','cc','dd','ee']

In [383]:
l2 = ['aa','bb','cc','dd','ee']*2

In [386]:
s1 = Series(l1)
s2 = Series(l2)
s3 = s1 + s2
s3.where(~s3.isna(),"xxx", inplace=True)
s3

0    aaaa
1    bbbb
2    cccc
3    dddd
4    eeee
5     xxx
6     xxx
7     xxx
8     xxx
9     xxx
dtype: object

In [387]:
s3.index = ['Bob','Alain']*5
s3['Bob']

Bob    aaaa
Bob    cccc
Bob    eeee
Bob     xxx
Bob     xxx
dtype: object

## DataFrame

In [388]:
df1 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'])
df1

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [389]:
df1.columns.name='col'
df1.index.name = 'key'
df1

col  a  b  c
key
0    1  2  3
1    4  5  6
2    7  8  9

In [390]:
l = ['aa','bb','cc','dd','ee']*2
s3 = Series(l)
s4 = Series(np.arange(5)) # taille differente mais avec les memes plage d'index

In [398]:
df2 = DataFrame()
df2[0] = s3
df2[1] = s4

# Cette ligne va ajouter des données vides car les 'a', 'b', ... n'existent pas
df2[2] = Series(np.arange(5),index=['a','b','c','d','e']) 

# maintenant le même index
df2[3] = Series(np.arange(5),index=[0,1,12,3,9]) 

# donc on se base sur l'index de la première série
df2

    0    1   2    3
0  aa  0.0 NaN  0.0
1  bb  1.0 NaN  1.0
2  cc  2.0 NaN  NaN
3  dd  3.0 NaN  3.0
4  ee  4.0 NaN  NaN
5  aa  NaN NaN  NaN
6  bb  NaN NaN  NaN
7  cc  NaN NaN  NaN
8  dd  NaN NaN  NaN
9  ee  NaN NaN  4.0

In [263]:
df2.where(~df2.isna(),'xxx')

    0    1    2
0  aa    0  xxx
1  bb    1  xxx
2  cc    2  xxx
3  dd    3  xxx
4  ee    4  xxx
5  aa  xxx  xxx
6  bb  xxx  xxx
7  cc  xxx  xxx
8  dd  xxx  xxx
9  ee  xxx  xxx

In [265]:
df2[0] # colonne

0    aa
1    bb
2    cc
3    dd
4    ee
5    aa
6    bb
7    cc
8    dd
9    ee
Name: 0, dtype: object

In [267]:
df2.loc[0] # pour les lignes

0     aa
1      0
2    NaN
Name: 0, dtype: object

In [400]:
df3 = DataFrame([s3,s4])

In [401]:
df3

    0   1   2   3   4    5    6    7    8    9
0  aa  bb  cc  dd  ee   aa   bb   cc   dd   ee
1   0   1   2   3   4  NaN  NaN  NaN  NaN  NaN

In [402]:
df3.columns = ['a','b','c','d','e','f','g','r','t','o'] # changer les noms des colonnes

In [403]:
df3.index = ['x','y']

In [404]:
index = df3.index # object index immutable

In [405]:
df3.values # liste de colonnes

array([['aa', 'bb', 'cc', 'dd', 'ee', 'aa', 'bb', 'cc', 'dd', 'ee'],
       [0.0, 1.0, 2.0, 3.0, 4.0, nan, nan, nan, nan, nan]], dtype=object)

In [406]:
df3

    a   b   c   d   e    f    g    r    t    o
x  aa  bb  cc  dd  ee   aa   bb   cc   dd   ee
y   0   1   2   3   4  NaN  NaN  NaN  NaN  NaN

In [407]:
'x' in df3

False

In [408]:
'a' in df3 # comme dans un dictionnaire

True

In [321]:
index.unique()

Index(['x'], dtype='object')

In [409]:
df4 = DataFrame(s3,s4) # S4 pour les index c'est équivalemnt à df2 = DataFrame(s3,index=s4). 
# Dans ce cas on se limite aux index de S4
df4

    0
0  aa
1  bb
2  cc
3  dd
4  ee

# Fonctionnalité essentielles

In [325]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']

In [327]:
df = pd.DataFrame({'http_status': [200,200,404,404,301],'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},index=index)

In [335]:
new_index= ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10', 'Chrome']

In [410]:
#not found are replaced with nan
df.reindex(new_index)

                A   B   C   D
Safari        NaN NaN NaN NaN
Iceweasel     NaN NaN NaN NaN
Comodo Dragon NaN NaN NaN NaN
IE10          NaN NaN NaN NaN
Chrome        NaN NaN NaN NaN

We can fill in the missing values by passing a value to
the keyword ``fill_value``. Because the index is not monotonically
increasing or decreasing, we cannot use arguments to the keyword
``method`` to fill the ``NaN`` values.

In [334]:
df.reindex(new_index, fill_value='missing')

              http_status response_time
Safari                404          0.07
Iceweasel         missing       missing
Comodo Dragon     missing       missing
IE10                  404          0.08
Chrome                200          0.02

In [339]:
df.reindex(columns=['http_status', 'user_agent'],method='ffill')

           http_status  user_agent
Firefox            200        0.04
Chrome             200        0.02
Safari             404        0.07
IE10               404        0.08
Konqueror          301        1.00

In [340]:
df.reindex(['http_status', 'user_agent'], axis="columns")

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

In [411]:
date_index = pd.date_range('1/1/2010', periods=6, freq='D')

In [412]:
df2 = pd.DataFrame({"prices": [100, 101, np.nan, 100, 89, 88]}, index=date_index)

In [413]:
df2

            prices
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0

In [414]:
date_index2 = pd.date_range('12/29/2009', periods=10, freq='D')

In [415]:
df2.reindex(date_index2)

            prices
2009-12-29     NaN
2009-12-30     NaN
2009-12-31     NaN
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

For example, to back-propagate the last valid value to fill the ``NaN``
values, pass ``bfill`` as an argument to the ``method`` keyword.
Please note that the NaN value present in the original dataframe (at index value 2010-01-03) 
will not be filled by any of the value propagation schemes. This is because filling while 
reindexing does not look at dataframe values, but only compares the original and desired indexes. If you do want to fill in the NaN values present in the original dataframe, use the fillna() method.

In [416]:
df2.reindex(date_index2, method='ffill')

            prices
2009-12-29     NaN
2009-12-30     NaN
2009-12-31     NaN
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07    88.0

In [419]:
df3 = df2.reindex(date_index2, method='ffill')
df3

            prices
2009-12-29     NaN
2009-12-30     NaN
2009-12-31     NaN
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07    88.0

In [361]:
df3.fillna(method='ffill', axis=0).fillna(method='bfill')

            prices
2009-12-29   100.0
2009-12-30   100.0
2009-12-31   100.0
2010-01-01   100.0
2010-01-02   101.0
2010-01-03   101.0
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07    88.0

In [420]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],[np.nan, np.nan, np.nan, 5], [np.nan, 3, np.nan, 4]], columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [364]:
#Replace all NaN elements with 0s.
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [365]:
# We can also propagate non-null values forward or backward.
df.fillna(method='ffill')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [366]:
#Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1, 2, and 3 respectively.
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [367]:
# Only replace the first NaN element.
df.fillna(value=values, limit=1)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  NaN  1
2  NaN  1.0  NaN  5
3  NaN  3.0  NaN  4

# Supprimer des entrées dans axe

- Return Series with specified index labels removed.

- Remove elements of a Series based on specifying the index labels. When using a multi-index, labels on different levels can be removed by specifying the level.

In [424]:
o = Series(np.arange(5),index=list('ABCDE'))
o.drop('A')

B    1
C    2
D    3
E    4
dtype: int64

In [425]:
o.drop(['B','E'])

A    0
C    2
D    3
dtype: int64

In [438]:
midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'], ['speed', 'weight', 'length','heigh']], 
                     codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2, 3]])

In [442]:
s = pd.Series([45, 200, 1.2, 30, 250, 1.5, 320, 1, 0.3, 1], index=midx)

In [480]:
s.drop(labels='weight', level=1)

lama    speed      45.0
        length      1.2
cow     speed      30.0
        length      1.5
falcon  speed     320.0
        length      0.3
        heigh       1.0
dtype: float64

# Indexer et localiser les données

In [507]:
midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'], ['speed', 'weight', 'length','heigh']], 
                     codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2, 3]])
s = pd.Series([45, 200, 1.2, 30, 250, 1.5, 320, 1, 0.3, 1], index=midx)
df = DataFrame(s)
df[1] = np.arange(10)
df[2] = np.random.randn(10)
df.columns = list('ABC')
df.index.names = ['Gender','Property']
df

                     A  B         C
Gender Property
lama   speed      45.0  0 -0.438421
       weight    200.0  1 -0.131874
       length      1.2  2  0.797741
cow    speed      30.0  3 -1.173175
       weight    250.0  4 -1.171483
       length      1.5  5  0.230502
falcon speed     320.0  6  0.024582
       weight      1.0  7 -1.615753
       length      0.3  8  0.566425
       heigh       1.0  9  0.848447

In [524]:
index = df.index

# seulement les lignes qui contiennent le sous index speed
df.loc[index[index.isin({'speed'},level=1)]]

                     A  B         C
Gender Property
lama   speed      45.0  0 -0.438421
cow    speed      30.0  3 -1.173175
falcon speed     320.0  6  0.024582

In [512]:
df.loc[index[1]]

A    200.000000
B      1.000000
C     -0.131874
Name: (lama, weight), dtype: float64

In [488]:
df[:1] # sélectionner des lignes

               A  B         C
lama speed  45.0  0 -0.460486

In [496]:
df.loc['lama'] #Single label. Note this returns a DataFrame with a single index.

            A  B         C
speed    45.0  0 -0.460486
weight  200.0  1  0.274253
length    1.2  2  1.373147

In [494]:
df.loc[('lama','speed')] #Single index tuple. Note this returns a Series.

A    45.000000
B     0.000000
C    -0.460486
Name: (lama, speed), dtype: float64

In [495]:
df.loc['lama','speed'] #Single label for row and column. Similar to passing in a tuple, this returns a Series.

A    45.000000
B     0.000000
C    -0.460486
Name: (lama, speed), dtype: float64

In [464]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]], index=['cobra', 'viper', 'sidewinder'], columns=['max_speed', 'shield'])
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [467]:
df.loc['viper'] #Single label. Note this returns the row as a Series.

max_speed    4
shield       5
Name: viper, dtype: int64

In [469]:
df.loc[['viper', 'sidewinder']] #List of labels. Note using ``[[]]`` returns a DataFrame.

            max_speed  shield
viper               4       5
sidewinder          7       8

In [470]:
df.loc['cobra', 'shield'] #Single label for row and column

2

In [471]:
# Slice with labels for row and single label for column. As mentioned
# above, note that both the start and stop of the slice are included.

df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [472]:
df.loc[[False, False, True]]  #Boolean list with the same length as the row axis

            max_speed  shield
sidewinder          7       8

In [473]:
df.loc[df['shield'] > 6]  #Conditional that returns a boolean Series

            max_speed  shield
sidewinder          7       8

In [474]:
df.loc[df['shield'] > 6, ['max_speed']] #Conditional that returns a boolean Series with column labels specified

            max_speed
sidewinder          7

In [475]:
df.loc[lambda df: df['shield'] == 8] #Callable that returns a boolean Series

            max_speed  shield
sidewinder          7       8

In [476]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50 #Set value for all items matching the list of labels
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50